[
    {
        "parent": "psychology",
        "description": "This class includes abstracts that are related to the scientific study of the human mind and its functions, particularly those affecting behavior in a given context. It may contain topics on mental health, cognitive processes, human development, social behavior, etc. Additionally, it may also encompass texts that discuss principles of social cognition and decision making in various contexts, such as environmental governance, socio-economic dynamics, political dynamics, and territorial development, provided that the overall content, purpose, and context of the text aligns more with psychological or cognitive science than with other fields. This class also includes texts that discuss topics related to specific professions or job roles, as long as the main focus of the research involves aspects of human behavior or decision making. Furthermore, if the text is more geared towards the psychological impacts, such as changes in cognitive functions or behavior, and uses the biochemical process as a basis to explain these changes, then it would be more suitable for the 'psychology' class. In essence, if the psychological implications and phenomena are the key focus, even with significant discussion of biochemical processes as a contributing factor, it's a psychology paper.",
        "subclasses": [
            {
                "name": "social cognition",
                "description": "This class includes abstracts that focus on the subfield of social psychology involving the study of how people perceive, think about, and remember information about others. This could include discussions about the role of perception in social interaction, the processing of social information, and how social cognition influences behavior. Abstracts under this class often delve into topics like decision making, behavior prediction, empathy, prejudice, and stereotyping. The primary emphasis of these abstracts is understanding how social information is processed, interpreted, and used to guide actions. Additionally, this class can also include abstracts that utilize principles of social cognition to analyze or understand broader topics or fields, such as environmental governance, or specific conditions like addiction, as long as the principles of social cognition play a significant role in the discussion or analysis. Furthermore, abstracts that discuss psychological concepts which significantly influence social behavior and cognition, even if not explicitly termed as 'social cognition', also fall under this class. This class also includes abstracts that discuss resilience factors and their role in social cognition, even if the main focus of the abstract is not directly on social cognition. Moreover, abstracts that discuss the psychological effects of environmental factors like pollution or climate change on human behavior and cognition, even if these are not the main focus of the paper, also fall under this class."
            },
            {
                "name": "child abuse",
                "description": "Abstracts under this class are primarily concerned with the exploration of child abuse and its psychological effects. These can include studies on the physical, sexual, emotional abuse or neglect of children, and their immediate or long-term psychological consequences. Topics can range from the identification and prevention of child abuse, intervention strategies, to the coping mechanisms employed by victims. The focus is on understanding the psychological impact of abuse on the child's development and behavior. Additionally, this class also includes abstracts discussing the role of various professionals, such as prehospital care providers, teachers, coaches, and club officials, in the detection and management of child abuse, as these contribute significant contextual knowledge to the understanding of child abuse. Furthermore, abstracts that discuss the physical abuse of child athletes, including violence, overtraining, and training while injured, also fall under this class. Moreover, abstracts that discuss protective factors or resilience in the context of child abuse, even if child abuse is not the main focus of the discussion, also belong to this class."
            }, 
            {
                "name": "attention",
                "description": "This class of abstracts is dedicated to the study of attention, a cognitive process that selects sensory information for perceptual processing. Abstracts in this class can cover a wide range of topics related to attention, such as attention span, selective attention, divided attention, sustained attention, and the like. The papers could explore the biochemical and psychological bases of attention, its role in cognition, or the effects of attention disorders. In essence, the main focus of these abstracts is the psychological mechanism of attention and its role in human behavior and cognitive processes. Additionally, this class can also include abstracts that discuss the impact of psychological concepts on specific demographics, even if the term 'attention' is not explicitly mentioned, as long as the concept significantly influences attentional processes. However, the primary focus of the text should be explicitly on attention and its processes for it to be categorized under the 'attention' class. Furthermore, abstracts discussing the impact of physical health conditions on attention and cognitive function, even if the primary focus is not on attention, can also be included in this class. Moreover, abstracts that discuss the influence of socio-economic factors and their impact on attention, even if these are not the main focus of the paper, also fall under this class. This class also includes abstracts that discuss environmental factors and their impact on attention and cognitive function, even if these are not the main focus of the paper." 
            },
            {
                "name": "depression",
                "description": "The abstracts in this class primarily deal with depression and related mood disorders, such as bipolar disorder and anxiety disorders. These abstracts may delve into the causes, symptoms, and treatment of depression or related mood disorders, or they may study the psychological effects of these conditions on human behavior and cognitive processes. The papers could also explore the relationship between depression and other psychological issues, such as anxiety, stress, or suicide. The overall emphasis is on understanding the psychological aspects of depression and its impacts on human behavior and cognition. This class also includes abstracts that discuss psychological concepts that significantly influence depressive behavior and cognition, even if depression is not the main focus of the discussion. Additionally, the role of various professionals in managing depression and their impact on the understanding and treatment of depression is also relevant to this class. Furthermore, abstracts discussing resilience factors in the context of depression or related mood disorders also belong to this class. Moreover, studies that investigate the impact of hormonal changes, such as during pregnancy, on the onset and progression of depression and related mood disorders also fall under this class. This class also includes abstracts that discuss physical health conditions and their psychological impacts, such as depression or impaired cognitive function, even if these are not the main focus of the paper."
            }
        ]
    }, 
    {
        "parent": "electrical engineering",
        "description": "This class is related to the field of electrical engineering. This may include topics on electronics, digital computers, power engineering, telecommunications, control systems, radio-frequency engineering, signal processing, instrumentation, etc. The text should primarily focus on these topics for it to be classified under electrical engineering. If a text discusses a topic related to a specific profession or job role, but the main focus of the text aligns more with electrical engineering, it should be classified under this category. Additionally, this class also includes texts that discuss the development, details, and implementation of devices and their electronic components, even if these devices are used in a medical or biological context, as long as the primary focus of the text is on the technical aspects rather than the biological application. However, texts that discuss biological processes in a technical manner, such as the functionality of a protein or gene, but do not delve into the technical aspects of devices or their electronic components, should not be classified under electrical engineering.",
        "subclasses": [
            {
                "name": "electricity",
                "description": "This class pertains to abstracts that primarily focus on the principles and applications of electricity, including power engineering, the development and implementation of electronic devices, and radio-frequency engineering. Texts discussing the technical aspects of power generation, distribution, and transmission, or those delving into the details of electronic components, should be classified under this category. This also includes texts where electricity production is a byproduct of another process or where electrical engineering principles are applied within the context of another field. However, if the text discusses the application of digital control systems or operational amplifiers, even within the context of electricity, and these systems or components are the main focus of the text, the text should be classified under the respective categories. In cases where the text discusses both the principles of electricity and the use of digital control systems, but the focus is not heavily tilted towards either, the text should be classified as 'digital control'. If the text discusses the use of a digital control system in an electrical device, but the focus is more on the performance improvement of the device rather than the technical details of the digital control system, it should be classified under 'Electricity'."
            },
            {
                "name": "digital control",
                "description": "Abstracts under this classification are majorly related to digital computers, control systems, and signal processing. This includes texts where the main focus is on the design, analysis, and operation of control systems, especially those using digital computers or digital signal processors. It also encompasses texts discussing the application and use of digital control systems, even if applied in a different field. In cases where the abstract discusses multiple topics that could potentially fall under more than one class, the text should be classified under this category if digital control systems are the most heavily focused upon or central to the study's outcomes. The classification is not dependent solely on the technicality but also the application and use of digital control systems. This class also includes texts that discuss principles of electricity, but where the application of these principles is done using digital control systems. Furthermore, if the text discusses the use of operational amplifiers within a digital control system, but the focus is more on the digital control system and its applications rather than the operational amplifier itself, it should be classified under 'Digital Control'. However, if the operational amplifier is a minor part of the discussion and the main focus is still the overall digital control system, then the text should be classified as 'digital control'. The classification should reflect the main focus of the text. Additionally, if the text discusses the use of an ADC (Analog to Digital Converter) or similar digital control techniques, even without explicitly mentioning 'digital control', it can still be classified under 'Digital Control'."
            },
            {
                "name": "operational amplifier",
                "description": "This class includes abstracts that primarily discuss operational amplifiers, a key component in many electronic devices. If an abstract explores the design, implementation, or technical details of operational amplifiers and their use in various circuits and systems, it should be classified under this category. This also extends to texts discussing specific techniques or methods related to operational amplifiers, as the focus is considered to be on the operational amplifier class that the technique is related to. Additionally, if the text discusses the application, the operational aspects, or the impact of an operational amplifier on a certain process or measurements, even without delving into the technical details of the amplifier itself, it can still be classified under 'operational amplifier'. However, if the abstract discusses multiple topics that could potentially fall under more than one class, the appropriate approach would be to prioritize the class that is most heavily focused upon or central to the study's outcomes. If the focus of the text is on how operational amplifiers are used within a digital control system, which means the main topic is the interaction and usage of operational amplifiers in such a system, then it should be classified under 'operational amplifier'. However, if the operational amplifier is a minor part of the discussion and the main focus is still the overall digital control system, then the text should be classified as 'digital control'. The classification should reflect the main focus of the text. Furthermore, if the operational amplifier is used as the primary tool to apply the principles of both electricity and digital control, it suggests that the operational amplifier is the main focus of the text, thus, the most appropriate category would be 'operational amplifier'. In cases where the text refers to an 'amplifying circuit' without explicitly mentioning an 'operational amplifier', but the context suggests its use, the text can be reasonably classified under 'operational amplifier'."
            }
        ]
    },
    {
        "parent": "biochemistry",
        "description": "This class is associated with the study of chemical processes within and relating to living organisms. It covers subjects such as molecular genetics, metabolism, protein structure and function, enzymology, cellular biochemistry, etc. The context and main focus of the text are important for classification. If a text discusses topics like social behavior primarily in the context of brain chemistry or hormonal influence, then it would be appropriate to classify it under biochemistry. However, the emphasis, depth of discussion, and perspective of the topics within the text guide the prioritization for classification. Texts that discuss the design, development or implementation of technological systems or devices, even if they are used in a biological context, should not be classified under biochemistry unless they delve into biochemical aspects such as molecular interactions, chemical processes or composition. Moreover, texts discussing the role and functionality of specific proteins or genes in an organism's growth and development, even if they don't delve into the molecular interactions or chemical processes, are also considered part of the biochemistry class. Additionally, texts that discuss the application of biochemical techniques, such as Western blot or ELISA, in the context of studying proteins or genes, even when connected with diseases, are also classified under biochemistry, as long as the primary focus remains on the biochemical processes and not on the technical workings of the techniques. Texts that discuss the biochemical effects of treatment protocols, such as therapeutic hypothermia, and their impact on the expression levels of proteins and genes, are also classified under biochemistry.",
        "subclasses": [
            {
                "name": "molecular biology",
                "description": "This class is associated with the study of biological activity at the molecular level, primarily focusing on the roles, interactions, and functions of DNA, RNA, proteins, and their biosynthesis. Abstracts discussing the structure and function of these molecules, including their roles in cellular processes and interactions, should be classified under this category. Additionally, this class also includes texts discussing specific biological processes or pathways, even when the techniques or methods used to study these processes are not explicitly mentioned. Furthermore, this class encompasses texts that discuss the application of molecular biology techniques in diagnosing diseases or identifying specific genes, even if the disease itself is closely related to another class such as immunology. The primary focus should be on the utilization of molecular biology techniques and not the disease being discussed. In cases where the text discusses multiple techniques but doesn't delve deeply into any, it could be beneficial to classify it into multiple categories, including molecular biology. This would ensure that the abstract is captured in searches related to all the techniques discussed. However, if a substantial portion of the text discusses the application of molecular biology techniques to the disease or its treatment, then it could be considered for the 'molecular biology' class. In these situations, the primary focus and context of the text should guide the classification.\n\n"
            },
            {
                "name": "polymerase chain reaction",
                "description": "This class relates to texts discussing the Polymerase Chain Reaction (PCR) technique, a common method used in molecular biology to amplify specific DNA or RNA sequences. Abstracts that focus on the application, methodology, or improvements of PCR should be categorized under this class. However, if the text discusses a biological process or pathway without explicitly mentioning the use of PCR or any other specific technique, it should be classified under 'molecular biology'. If the text heavily focuses on a specific technique like PCR, it should be classified under this category. However, if the mention of PCR is just in passing and the main focus is still on molecular biology as a wider field, then it could still be classified under 'molecular biology'. In cases where the text discusses multiple techniques but doesn't delve deeply into any, it could be beneficial to classify it into multiple categories. This would ensure that the abstract is captured in searches related to all the techniques discussed. Additionally, if PCR is used as a tool in the research methodology, even if it's not the main focus of the study, the text could potentially be classified under 'polymerase chain reaction'. If the text discusses the use of PCR for a specific purpose such as diagnosing a disease or identifying a gene, the context of the text as a whole should be taken into account for accurate classification.\n\n"
            },
            {
                "name": "northern blotting",
                "description": "This class pertains to abstracts that discuss the technique of Northern Blotting, used in molecular biology to study gene expression by detection of RNA in a sample. Texts that delve into the procedure, application, or interpretation of Northern Blotting results should fall under this classification. However, if the text discusses a biological process or pathway without explicitly mentioning the use of Northern Blotting, but the understanding and discussion of such processes falls under the realm of molecular biology, the text should be classified under 'molecular biology'. If the text heavily focuses on a specific technique like Northern Blotting, it should be classified under this category. This includes texts where Northern Blotting plays a crucial role in the results and conclusions drawn from the research, even if other techniques are also used. However, if the mention of Northern blotting is just in passing and the main focus is still on molecular biology as a wider field, then it could still be classified under 'molecular biology'. In cases where the text discusses multiple techniques but doesn't delve deeply into any, it could be beneficial to classify it into multiple categories. This would ensure that the abstract is captured in searches related to all the techniques discussed.\n\n"
            },
            {
                "name": "immunology",
                "description": "This class is associated with the study of the immune system in all its aspects, including its structure and function, disorders of the immune system, immune responses to pathogens, and immunotherapy. Abstracts discussing these topics, including the molecular mechanisms of immune responses, should be classified under immunology. The primary focus should be directly on components and functioning of the immune system itself. However, if the implications on the immune response are substantial and deeply intertwined with the primary discussion, the 'immunology' classification could potentially be considered. Additionally, if the abstract also delves into the immunological response to a disease or the mechanisms of the immune system related to the disease in addition to mentioning molecular biology techniques, it could potentially be classified under 'immunology'. In cases where multiple techniques are discussed without a deep dive into any specific one, the text could be classified under multiple categories including 'immunology'. The classification really depends on the main emphasis of the text. Furthermore, if the text discusses the application of a specific technique (like Western blot or ELISA) in the diagnosis of a disease, but doesn't delve deeply into the technique itself, it could still be classified under 'immunology'. The text can also be classified under 'immunology' if it discusses the use of immunotherapeutic agents and cytokine immunotherapy for treating diseases, even without a detailed description of the techniques used. Also, texts discussing the function and behavior of specific cell types in relation to immunity should be classified under 'immunology', even if no specific technique or method is mentioned. This class also includes texts that discuss potential zoonotic transfer of diseases, indicating a study of host-pathogen interactions and immune response.\n\n"
            }
        ]
    }
]
